onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Р1_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Р1_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Р1_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/Р1_ДоработкаДокументов/Module.bsl
#Область ПрограммныйИнтерфейс
//Процедура выводит на форму документов поле "контактное лицо"
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить поле "Контактное лицо".
Процедура ВывестиПолеКонтактноеЛицо(Форма) Экспорт
// ++ Бедрышева Н.В. Задача Выведение поля "Контактное лицо" (09.02.2025) 
	ИмяФормы = Форма.ИмяФормы; 	
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" ИЛИ
		 	 	ИмяФормы =  "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" ИЛИ 
		 		ИмяФормы =  "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"  Тогда
		 			
						НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
						НовыйЭлемент.ПутьКДанным = "Объект.Р1_КонтактноеЛицо"; 
						НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
						НовыйЭлемент.Заголовок = "Контактное лицо";
						
		ИначеЕсли ИмяФормы =  "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" ИЛИ 
		 			ИмяФормы =  "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 			
		 				СледующийЭлемент = Форма.Элементы.Найти("СуммаДокумента");
						НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , СледующийЭлемент);
						НовыйЭлемент.ПутьКДанным = "Объект.Р1_КонтактноеЛицо"; 
						НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
						НовыйЭлемент.Заголовок = "Контактное лицо";		 								
		КонецЕсли;				
	КонецЕсли;
// -- Бедрышева Н.В. Задача Выведение поля "Контактное лицо" (09.02.2025) 

КонецПроцедуры

//Процедура выводит на форму документов поле "Согласованная скидка"
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить поле "Контактное лицо".
Процедура ВывестиКнопкуИПолеСогласованнаяСкидка(Форма)  Экспорт
	
// ++ Бедрышева Н.В. Задача "Согласованная скидка" (09.02.2025) 	
	Если Форма.Элементы.Найти("ГруппаСкидка") = Неопределено Тогда
		НоваяГруппа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;  
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		
		Если Форма.Элементы.Найти("Р1_СогласованнаяСкидка") = Неопределено Тогда
			НовыйЭлемент = Форма.Элементы.Добавить("Р1_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
			НовыйЭлемент.ПутьКДанным = "Объект.Р1_СогласованнаяСкидка"; 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Согласованная скидка";  
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_СогласованнаяСкидкаПриИзменении");
		КонецЕсли;
		
		Если Форма.Элементы.Найти("КнопкаПересчитатьТаблицы") = Неопределено Тогда
			НоваяКоманда = Форма.Команды.Добавить("ПересчитатьТаблицы");
			НоваяКоманда.Заголовок = "Пересчитать таблицы";
			НоваяКоманда.Действие = "ПересчитатьТаблицы";   
			НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			НоваяКоманда.Картинка = БиблиотекаКартинок.Обновить;
		
			НовыйЭлемент = Форма.Элементы.Добавить("КнопкаПересчитатьТаблицы", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
			НовыйЭлемент.ИмяКоманды = "ПересчитатьТаблицы";
			НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КонецЕсли;
		
	КонецЕсли;
// -- Бедрышева Н.В. Задача "Согласованная скидка" (09.02.2025)
КонецПроцедуры
//конец области Программный Интерфейс	

#КонецОбласти
